# Задайте список из n чисел последовательности (1 + 1 / n) ** n и выведите на экран их сумму.

# Пример:

# - Для n = 6: [2.0, 2.25, 2.37, 2.44, 2.49, 2.52]
# - Сумма = 14.07

n = int(input('Введите число: '))
count = 0
my_list = []
for i in range(1, n + 1):
    count += round((1 + 1 / i) ** i, 2)
    my_list.append(round((1 + 1 / i) ** i, 2))
print(f'Список числа n: {my_list}\nСумма = {count}')
